#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>


//int main()
//{
//	int a = 7 % 2;
//	int b = 7 / 2;
//	printf("%d\n", a);
//	printf("%d\n", b);
//
//	return 0;
//}


//整数的二进制表示有三种
//1.原码
//2.反码
//3.补码
//正的整数的原码、反码、补码相同
//负的整数的原码、反码、补码是要计算的
//7表示为二进制为
//00000000000000000000000000000111 - 原码、反码、补码
// 
// 
// -7表示为二进制为
// 1000000000000000000000000000111 - 原码（第一位为符号位）
// 1111111111111111111111111111000 - 反码（原码的符号位不变，其他位按位取反）
// 1111111111111111111111111111001 - 补码（反码+1就是补码）
// 
// 
// 整数在内存中存储的是补码
// 
//


//int main()
//{
//	int a = 7;
//	int b = a << 1;
//
//
//	//左移操作符，移动的是二进制位
//	printf("a=%d\n", a);
//	printf("b=%d\n", b);
//	return 0;
//}


//int main()
//{
//	int a = -7;
//	int b = a << 1;
//
//
//	//左移操作符，移动的是二进制位
//	printf("a=%d\n", a);
//	printf("b=%d\n", b);
//	return 0;
//}


//int main()
//{
//	float f = 3.14f;
//	float f2= f << 1;
//	//左移、右移操作符只针对整数
//	return 0;
//}


//int main()
//{
//	int a = 7;
//	int b = a >> 1;
//	printf("a=%d\n", a);
//	printf("b=%d\n", b);
//	return 0;
//}


//int main()
//{
//	int a = -7;
//	int b = a >> 1;
//	printf("a=%d\n", a);
//	printf("b=%d\n", b);
//	return 0;
//}


// & 按（二进制）位与	只要有0就为0，只有两个都为1才为1
// | 按（二进制）位或	只要有1就为1，只有两个都为0才为0
// ^ 按（二进制）位异或	相同为0，相异为1
 

//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a & b;
//	//0000000000000000000000000000011 - 3的补码
//	//
//	// 
//	//1000000000000000000000000000101 - -5的原码
//	//1111111111111111111111111111010 - -5的反码
//	//1111111111111111111111111111011 - -5的补码
//	//0000000000000000000000000000011 - 3的补码
//	// 000000000000000000000000000011 - 结果为3
//	// 
//	// 
//	// %d 意味着打印一个有符号的整数
//	//
//
//
//	printf("c=%d\n", c);
//	return 0;
//}


//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a | b;
//	//0000000000000000000000000000011 - 3的补码
//	//
//	// 
//	//1000000000000000000000000000101 - -5的原码
//	//1111111111111111111111111111010 - -5的反码
//	//1111111111111111111111111111011 - -5的补码
//	//0000000000000000000000000000011 - 3的补码
//	//1111111111111111111111111111011 补码
//	//1111111111111111111111111111010 反码
//	//1000000000000000000000000000101 原码，结果为-5
//
//
//	printf("c=%d\n", c);
//	return 0;
//}


//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a ^ b;
//	//0000000000000000000000000000011 - 3的补码
//	//
//	// 
//	//1000000000000000000000000000101 - -5的原码
//	//1111111111111111111111111111010 - -5的反码
//	//1111111111111111111111111111011 - -5的补码
//	//0000000000000000000000000000011 - 3的补码
//	//1111111111111111111111111111000 补码
//	//1111111111111111111111111110111 反码
//	//1000000000000000000000000001000 原码，结果为-8
//
//
//	printf("c=%d\n", c);
//	return 0;
//}


//不创建临时变量，实现两个数的交换


//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = 0;
//	printf("交换前:a=%d b=%d\n", a, b);
//	c = a;
//	a = b;
//	b = c;
//	printf("交换后:a=%d b=%d\n", a, b);
//
//	return 0;
//}


//int main()
//{
//	int a = 3;
//	int b = 5;
//这种方法会有溢出的问题
//	printf("交换前:a=%d b=%d\n", a, b);
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	printf("交换后:a=%d b=%d\n", a, b);
//
//	return 0;
//}


////3^3=0		a^a=0
////0^5=5		0^a=a
////异或操作符支持交换律
// 
//
//int main()
//{
//	int a = 3;
//	int b = 5;
//
//	printf("交换前:a=%d b=%d\n", a, b);
//	a = a ^ b;//3^5
//	b = a ^ b;//3^5^5=3
//	a = a ^ b;//3^5^3=5
//	printf("交换后:a=%d b=%d\n", a, b);
//
//	return 0;
//}


////求一个整数存储在内存中的二进制中1的个数
//
//
//int main()
//{
//	int num = 7;
//	int count = 0;
//	while (num)
//	{
//		if ((num & 1) == 1)
//		{
//			count++;
//		}
//		num = num >> 1;
//	}
//	printf("num中1的个数有：%d", count);
//	return 0;
//}


//int main()
//{
//	int a = 3;//初始化
//
//
//	int b = 0;
//	b = 20;//赋值
//
//
//	return 0;
//}


//int main()
//{
//	int a = 10;
//	int x = 0;
//	int y = 20;
//
//
//	a = x = y + 1;//连续赋值，语法支持但不建议使用
//	printf("a=%d x=%d y=%d\n", a, x, y);
//	return 0;
//}


//int main()
//{
//	int a = 3;
//	a = a + 5;
//	a += 5;
//
//
//	a = a >> 1;
//	a >>= 1;
//
//
//
//	return 0;
//}


//int main()
//{
//	int flag = 3;
//	//flag为真,进入if
//	if (flag)
//	{
//
//	}
//
//	//flag为假，进入if
//	if (!flag)
//	{
//
//	}
//	return 0;
//}
//c语言中0表示假，非0表示真


//int main()
//{
//	int a = 10;
//	printf("%p\n", &a);
//	int* p = &a;//p就是指针变量
//	return 0;
//}


//int main()
//{
//	int a = 10;
//	//int n = sizeof(a);//计算的是a所占的内存的大小，单位是字节
//	int n = sizeof(int);
//	//sizeof是一个操作符
//	//计算的是类型/变量所占内存空间的大小
//	//计算类型所创建的变量占据空间的大小，单位是字节
//
//
//	printf("n=%d\n", n);
//	return 0;
//}


//int main()
//{
//	int arr[5] = { 0 };
//	printf("%d\n", sizeof(arr));
//	return 0;
//}


//int main()
//{
//	//int a = 0;
//
//
//	////~按二进制位取反
//	////00000000000000000000000000000000 - 0的补码
//	////11111111111111111111111111111111 - ~a的补码
//	////11111111111111111111111111111110 - ~a的反码
//	////10000000000000000000000000000001 - ~a的原码
//	////
//	//printf("%d\n", ~a);
//
//
//	int a = 3;
//	printf("%d\n", ~a);
//	//
//	// 
//	//00000000000000000000000000000011 - 3的补码
//	//11111111111111111111111111111100 - ~a的补码
//	//11111111111111111111111111111011 - ~a的反码
//	//10000000000000000000000000000100 - ~a的原码
//	return 0;
//}


//int main()
//{
//	int a = 13;
//	a |= ( 1 << 1 );
//	printf("%d\n", a);
//
//
//	//00000000000000000000000000001101 - 13的补码
//	//00000000000000000000000000000010
//	// 1<<1
//	// 0000000000000000000000000001111
//	//
//	return 0;
//}


//int main()
//{
//	int a = 13;
//	a |= (1 << 4);
//	printf("%d\n", a);
//	a &= (~(1 << 4));
//	printf("%d\n", a);
//
//	//
//	//00000000000000000000000000001101
//	//00000000000000000000000000011101
//	// 
//	// 
//	//
//	return 0;
//}


//int main()
//{
//	int a = 3;
//	//int b = ++a;//前置++，先++，后使用
//	//a=a+1，b=a
//	int b = a++;//后置++，先使用，后++
//
//
//	printf("%d\n", a);
//	printf("%d\n", b);
//	return 0;
//}


//int main()
//{
//	int a = 3;
//	//int b = --a;//前置--，先--，后使用
//	//a=a-1;b=a;
//	int b = a--;//后置--，先使用，后--
//	//b=a;a=a-1;
//	
//
//	printf("a=%d b=%d\n", a, b);
//	return 0;
//}


//int main()
//{
//	int a = 10;
//	printf("%d\n", a--);
//	printf("%d\n", a);
//	return 0;
//}


//int main()
//{
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//
//	}
//	for (i = 0; i < 10; ++i)
//	{
//
//	}
//	return 0;
//}


//int main()
//{
//	int a = 10;
//	int* p = &a;
//	*p = 20;
//	printf("%d\n", a);
//	return 0;
//}


//int main()
//{
//	//int a = 3.14;
//	int a = (int)3.14;//将3.14（double）类型强制转换成（int）类型
//	printf("%d\n", a);
//	return 0;
//}


//int main()
//{
//	int a = 0;
//	printf("%d\n", sizeof(a));
//	printf("%d\n", sizeof(int));
//
//	printf("%d\n", sizeof a);//ok
//	//printf("%d\n", sizeof int);//err
//
//	return 0;
//}
//sizeof是操作符，不是函数
//strlen是库函数，是用来求字符串长度


//void test1(int arr[])
//{
//	printf("%d\n", sizeof(arr));//40	x	8√
//}
//void test2(char ch[])
//{
//	printf("%d\n", sizeof(ch));//4	x	8√
//}
//int main()
//{
//	int arr[10] = { 0 };
//	char ch[10] = { 0 };
//	printf("%d\n", sizeof(arr));//40√
//	printf("%d\n", sizeof(ch));//4	x	10√
//	test1(arr);
//	test2(ch);
//	return 0;
//}


//int main()
//{
//	if (3 == 5)
//	{ }
//	//err
//	if("abc"=="abcdef")//这样写是在比较两个字符串的首字符的地址
//	{ }
// 两个字符串比较相等，应该使用strcmp
//	return 0;
//}


//int main()
//{
//	int a = 0;
//	int b = 0;
//	//int c = a && b;//并且，两者为真则为真
//	int c = a || b;//或者,只要有一个为真则为真
//
//
//	printf("%d\n", c);
//	return 0;
//}


//int is_leap_year(int y)
//{
//	if ((y % 4 == 0) && (y % 100 != 0) || (y % 400 == 0))
//	{
//		return 1;
//	}
//	else
//		return 0;
//}
//
//
//int main()
//{
//
//	return 0;
//}


//int main()
//{
//	/*int i = 0;
//	int a = 0;
//	int b = 2;
//	int c = 3;
//	int d = 4;*/
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	//i = a++ && ++b && d++;
//	i=a++||++b||d++;
//	printf("a=%d\n b=%d\n c=%d\n d=%d\n", a, b, c, d);
//	return 0;
//}


//int main()
//{
//	int a = 3;
//	int b = 0 ;
//
//
// int max = (a > b ? a: b );
// 
// 
//	if (a > 5)
//	{
//		b = 3;
//	}
//	else
//		b = -3;
//
//
//
//	(a > 5) ? (b = 3) : (b = -3);
//
//	b = (a > 5 ? 3 : -3);
//	return 0;
//}


//int main()
//{
//	int a = 1;
//	int b = 2;
//	int c = (a > b, a = b + 10, a, b = a + 1);
//
//
//	printf("%d\n", c);
//	return 0;
//}


//int main()
//{
//	int arr[10] = { 0 };
//	//arr[7] --> *(arr+7) -->*(7+arr) --> 7[arr]
//	//arr是首元素的地址
//	//arr+7就是跳过7个元素，指向了第8个元素
//	//*(arr+7)就是第8个元素
//
//	arr[7] = 8;
//	7[arr] = 9;
//	return 0;
//}


////函数定义
//int Add(int x, int y)
//{
//	return x + y;
//}
//
//
//int main()
//{
//	int a = 10;
//	int b = 20;
//	//函数调用
//	int c = Add(a, b);//()就是函数调用操作符
//	return 0;
//}


//#include<string.h>
//struct Stu
//{
//	char name[20];
//	int age;
//	double sore;
//};
//
//
//void set_stu(struct Stu* ps)
//{
//	/*strcpy((*ps).name, "zhangsan");
//	(*ps).age = 20;
//	(*ps).sore = 100.0;*/
//	strcpy(ps->name, "zhangsan");
//	ps->age = 20;
//	ps->sore = 100.0;
//}
//void print_stu(struct Stu* ps)
//{
//	printf("%s %d %lf\n", ps->name, ps->age, ps->sore);
//}
//
//
//
//int main()
//{
//	struct Stu s = { 0 };
//	set_stu(&s);
//	print_stu(&s);
//
//	return 0;
//}


//int main()
//{
//	int a = 2 + 6 / 3;
//	printf("%d", a);
//	return 0;
//}


//int main()
//{
//	char c = -1;//-1是整数，32个比特位
//	//10000000000000000000000000000001 -- -1的原码
//	//11111111111111111111111111111110 -- -1的反码
//	//11111111111111111111111111111111 -- -1的补码
//	//11111111 -- c
//	//11111111111111111111111111111111
//	return 0;
//}


//int  4byte --32个比特位
//char 1byte --8个比特位
//int main()
//{
//	char a = 5;
//	//00000000000000000000000000000101		正数的原、反、补码都相同
//	char b = 126;
//	//00000000000000000000000001111110
//	char c = a + b;
//	
//	//00000101 ->a
//	//01111110 ->b
//	//
//	//00000000000000000000000000000101 ->a
//	//00000000000000000000000001111110 ->b
//	//00000000000000000000000010000011
//	//10000011 ->c
//	//11111111111111111111111110000011 -- 补码
//	//11111111111111111111111110000010 -- 反码
//	//10000000000000000000000001111101 -- 原码
//
//	printf("%d\n", c);//-125
//	return 0;
//}


//int main()
//{
//	char a = 0xb6;
//	short b = 0xb600;
//	int c = 0xb6000000;
//	if (a == 0xb6)
//	{
//		printf("a");
//	}
//	if (b == 0xb600)
//	{
//		printf("b");
//	}
//	if (c == 0xb6000000)
//	{
//		printf("c");
//	}
//	return 0;
//}


//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c));//1
//	printf("%u\n", sizeof(+c));//4
//	printf("%u\n", sizeof(-c));//4
//	return 0;
//}


int main()
{
	int a = 1;
	int b = (++a) + (++a) + (++a);
	printf("%d\n", b);
	return 0;
}